{
    "version": "https://jsonfeed.org/version/1",
    "title": "Freight Factory",
    "description": "",
    "home_page_url": "https://tristanza.github.io/Freight-Factory",
    "feed_url": "https://tristanza.github.io/Freight-Factory/feed.json",
    "user_comment": "",
    "author": {
        "name": "Tristan Wiggill"
    },
    "items": [
        {
            "id": "https://tristanza.github.io/Freight-Factory/estate-agents-earn-more-with-freight-factory/",
            "url": "https://tristanza.github.io/Freight-Factory/estate-agents-earn-more-with-freight-factory/",
            "title": "Estate Agents Earn More With Freight Factory",
            "summary": "Apart from buying or selling homes, your clients may wish to import, export or relocate their vehicles or other high-value personal goods. When you refer these clients to Freight Factory and they make use of our world-class shipping services, we pay you a handsome commission,&hellip;",
            "content_html": "<p><strong>Apart from buying or selling homes, your clients may wish to import, export or relocate their vehicles or other high-value personal goods. </strong></p>\n<p><span style=\"font-weight: 400;\">When you refer these clients to Freight Factory and they make use of our world-class shipping services, we pay you a handsome commission, no questions asked!</span></p>\n<p> </p>\n<h2 class=\"msg msg--info\">You don't have to lift a finger</h2>\n<p> </p>\n<p><span style=\"font-weight: 400;\">The best part is, you don’t have to worry about anything - Freight Factory takes the hassle out of shipping cars, motorcycles, boats, caravans and other high-value personal items into, out of and across South Africa.</span></p>\n<p><span style=\"font-weight: 400;\">We facilitate all aspects of shipping, be it full or shared container loads. We do all required export/import documentation. And we even offer comprehensive marine insurance. </span></p>\n<p><span style=\"font-weight: 400;\">All required export documents are done by our traffic official. We handle  import applications, ie. Import ITAC Permits, LOA’s, TIP’s, Carnets, Importers Codes and Rebates.</span></p>\n<p> </p>\n<h2 class=\"msg msg--info\">Tight security 24/7</h2>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Freight Factory’s operation is tightly controlled with well-trained, in-house staff. Only the best tried and tested suppliers and destination agents are used. </span></p>\n<p><span style=\"font-weight: 400;\">The warehouses and loading facilities are based within secure business parks, giving your client's discretion and the peace of mind they deserve whilst we handle their precious assets.</span></p>\n<p><span style=\"font-weight: 400;\">All vehicles are parked indoors in secure business parks with controlled access. Full CCTV cameras are linked to armed response. </span></p>\n<p> </p>\n<h2 class=\"msg msg--info\"><strong>We accommodate all vehicle types and sizes </strong></h2>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Vehicles are loaded at our warehouse by our own staff. If the vehicle requires local / national relocation, we arrange this too. We can also view/vet vehicles on behalf of your clients that do not reside in South Africa. </span></p>\n<p><span style=\"font-weight: 400;\">All vehicles stored with us receive a car cover and, if needed, battery charging until shipping. </span></p>\n<p> </p>\n<h2 class=\"msg msg--success msg--info\"><strong>Your clients get up to three months FREE vehicle storage</strong></h2>\n<p> </p>\n<p><span style=\"font-weight: 400;\">On arrival in either of our warehouses, full inspection checks sheets with photographs are completed and compared to the road haulers/client pre-trip check sheet.  </span></p>\n<p><span style=\"font-weight: 400;\">Inspections with sellers puts both buyers and sellers at ease when purchasing vehicles abroad.  Full, detailed checks are done on each vehicle inspected. </span></p>\n<p><span style=\"font-weight: 400;\">Depending on what your client requires, we can either supply extensive photographs or Facetime your client, walking them around the vehicle in real-time.</span></p>\n<p> </p>\n<h2 class=\"msg msg--info\"><strong>All paperwork is checked and validated prior to any monies changing hands</strong></h2>\n<p> </p>\n<p><span style=\"font-weight: 400;\">If required, monies can be paid into a holding bank account and, once given the go ahead from the buyer, be released to the seller who takes receipt thereof.</span></p>\n<p><span style=\"font-weight: 400;\">Once we are satisfied that the vehicle is in the same condition as when it left the seller’s premises, will we sign off receipt of the vehicle.</span></p>\n<p><span style=\"font-weight: 400;\">You’ve worked hard to sell your client’s home, now let Freight Factory take care of their shipping needs! </span></p>\n<p class=\"msg msg--highlight \"><span style=\"font-weight: 400;\">To start getting your commission, contact Tristan Wiggill now on +27 073 972 5086 or <a href=\"mailto:tristan@yandex.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">send him an email</a></span></p>\n<p><br><br><br><br><br></p>",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
            ],
            "date_published": "2021-02-17T13:43:07+02:00",
            "date_modified": "2021-02-17T17:03:46+02:00"
        }
    ]
}
